src/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПродажаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьСуммуДокумента()
	
	 ОбщаяСумма=0;
	 
	 Для Каждого СтрокаТовары Из Объект.Товары Цикл
		 ОбщаяСумма = ОбщаяСумма + СтрокаТовары.Сумма;
	 КонецЦикла;
	 
	 Возврат ОбщаяСумма;
	 
 КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СуммаДокумента = ПолучитьСуммуДокумента();
	Сообщить("Сумма документа: " + СуммаДокумента);

КонецПроцедуры


&НаКлиенте
Процедура ПроверитьДокумент(Отказ)
	
	// Проверяем, что выбран контрагент
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить ("Ошибка: выберите контрагента!");
		Отказ = Истина;
	КонецЕсли;
	
	//Проверяем, что в документе есть хотя бы одна строка
	Если Объект.Товары.Количество() = 0 Тогда
		Сообщить("Ошибка: добавьте хотя бы одну строку в табличную часть!");
		Отказ=Истина;
	КонецЕсли
КонецПроцедуры

 &НаКлиенте
 Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 
	  ПроверитьДокумент(Отказ);
	  
  КонецПроцедуры

&НаКлиенте
  Процедура РассчитатьИтого(Команда)
	  // Вставить содержимое обработчика.
	  
	  ОбщаяСумма = 0;
	  
	  //Пересчитываем сумму каждой строки и копим общий итог
	  Для Каждого СтрокаТовары Из Объект.Товары Цикл
		  СтрокаТовары.Сумма = СтрокаТовары.Количество * СтрокаТовары.Цена;
		  ОбщаяСумма = ОбщаяСумма + СтрокаТовары.Сумма;
	  КонецЦикла;
	  
	  Сообщить("Итого по документу: " + ОбщаяСумма);
  КонецПроцедуры
